app/views/users/_user.html.haml

    .modal-body
      = collection_select :user, :role_ids, Role.all, :id, :name, checked: user.role_ids.first
    .modal-footer
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ? ORDER BY "roles"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT "users".* FROM "users"