app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads" WHERE "uploads"."user_id" = ?  [["user_id", 2]]
SELECT "uploads".* FROM "uploads"
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
---
  def index
    @uploads = Upload.where(user_id:current_user.id)

    respond_to do |format|
      format.html # index.html.erb
      format.json { render json:  @uploads.map{|upload| upload.to_jq_upload } }

INSERT INTO "uploads" ("created_at", "updated_at", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @upload = Upload.new(params[:upload])
    @upload.user_id = current_user.id
    respond_to do |format|
      if @upload.save

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "uploads" WHERE "uploads"."id" = ?  [["id", 1]]
---
  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
---
  def load_user
    @user=User.find(current_user.id)