app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Необходимо авторизироваться как "Администратор".'
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1

  def update
    authorize! :update, @user, :message => 'Not authorized as an administrator.'
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1

  def destroy
    authorize! :destroy, @user, :message => 'Необходимо авторизироваться как "Администратор".'
    user = User.find(params[:id])
    unless user == current_user
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]